import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:firebase_auth/firebase_auth.dart';
import 'package:netflix/legal.dart';
class Legal_hindi extends StatefulWidget {
  const Legal_hindi({Key? key}) : super(key: key);

  @override
  State<Legal_hindi> createState() => _Legal_hindiState();
}

class _Legal_hindiState extends State<Legal_hindi> {
  bool isDark=false;
  final FirebaseFirestore _firestore = FirebaseFirestore.instance;
  final FirebaseAuth _auth = FirebaseAuth.instance;

  String selectedValue = 'English'; // Initial selected value

  @override
  void initState() {
    // TODO: implement initState
    super.initState();
  }
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: isDark?Colors.white:Colors.black,
      appBar: AppBar(
        backgroundColor: Colors.black,
        centerTitle: true,
        actions: [
          IconButton(onPressed: (){
            setState(() {
              isDark=!isDark;
            });
          },
              icon: Icon(isDark?Icons.sunny:Icons.nights_stay_rounded,
                color: Colors.white,))
        ],
        title: Text(
          'NetFly',
          style: GoogleFonts.amaranth(
            color: Colors.red,
            fontWeight: FontWeight.bold,
            fontSize: 20,
          ),
        ),

      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(
                height: 30,
              ),
              Center(
                child: Text('कानूनी और गोपनीयता नीति',style: TextStyle(fontSize: 20,
                    fontWeight: FontWeight.bold,
                    color: isDark?Colors.black:Colors.white),),
              ),
              SizedBox(
                height: 20,
              ),
              Text(''' यह गोपनीयता कथन नेटफ्लिक्स सेवा के संबंध में आपकी व्यक्तिगत जानकारी सहित कुछ जानकारी के संग्रह, उपयोग और प्रकटीकरण के संबंध में आपकी पसंद सहित हमारी प्रथाओं की व्याख्या करता है।

हमसे संपर्क कर रहे हैं
यदि आपके पास अपने खाते के बारे में सामान्य प्रश्न हैं या सहायता के लिए ग्राहक सेवा से संपर्क कैसे करें, तो कृपया help.netfly.com पर हमारे ऑनलाइन सहायता केंद्र पर जाएँ। विशेष रूप से इस गोपनीयता कथन, या आपकी व्यक्तिगत जानकारी, कुकीज़ या इसी तरह की तकनीकों के हमारे उपयोग के बारे में प्रश्नों के लिए, कृपया हमारे डेटा सुरक्षा अधिकारी/गोपनीयता कार्यालय से privacy@netfly.com पर ईमेल द्वारा संपर्क करें।

आपकी व्यक्तिगत जानकारी का डेटा नियंत्रक नेटफ्लिक्स एंटरटेनमेंट सर्विसेज इंडिया एलएलपी है। कृपया ध्यान दें कि यदि आप अपनी सहायता के लिए हमसे संपर्क करते हैं, तो आपकी और हमारी सुरक्षा के लिए हमें आपका अनुरोध पूरा करने से पहले आपकी पहचान प्रमाणित करने की आवश्यकता हो सकती है।

सूचना का संग्रहण
हम आपके बारे में जानकारी प्राप्त करते हैं और संग्रहीत करते हैं जैसे:

आपके द्वारा हमें प्रदान की गई जानकारी: हम आपके द्वारा हमें प्रदान की गई जानकारी एकत्र करते हैं जिसमें शामिल हैं:
आपका नाम, ईमेल पता, भुगतान विधि, टेलीफोन नंबर, और अन्य पहचानकर्ता जिनका आप उपयोग कर सकते हैं (जैसे कि इन-गेम नाम)। हम यह जानकारी कई तरीकों से एकत्र करते हैं, जिसमें जब आप हमारी सेवा का उपयोग करते समय इसे दर्ज करते हैं, हमारी ग्राहक सेवा के साथ बातचीत करते हैं, या सर्वेक्षण या विपणन प्रचार में भाग लेते हैं;
जानकारी जब आप रेटिंग, स्वाद प्राथमिकताएं, खाता सेटिंग्स (हमारी वेबसाइट के "खाता" अनुभाग में निर्धारित प्राथमिकताओं सहित) प्रदान करना चुनते हैं, या अन्यथा हमारी सेवा या अन्यत्र के माध्यम से हमें जानकारी प्रदान करते हैं।
जानकारी हम स्वचालित रूप से एकत्र करते हैं: हम आपके और हमारी सेवा के उपयोग, हमारे साथ आपकी बातचीत और हमारे विज्ञापन के बारे में जानकारी एकत्र करते हैं, साथ ही आपके नेटवर्क, नेटवर्क उपकरणों और आपके कंप्यूटर या अन्य नेटफ्लिक्स सक्षम उपकरणों के बारे में जानकारी एकत्र करते हैं जिनका उपयोग आप हमारी पहुंच के लिए कर सकते हैं। सेवा (जैसे गेमिंग सिस्टम, स्मार्ट टीवी, मोबाइल डिवाइस, सेट टॉप बॉक्स और अन्य स्ट्रीमिंग मीडिया डिवाइस)। इस जानकारी में शामिल हैं:
नेटफ्लिक्स सेवा पर आपकी गतिविधि, जैसे शीर्षक चयन, आपके द्वारा देखे गए शो, खोज क्वेरी और नेटफ्लिक्स गेम्स में गतिविधि;
हमारे ईमेल और टेक्स्ट के साथ, और पुश और ऑनलाइन मैसेजिंग चैनलों के माध्यम से हमारे संदेशों के साथ आपकी बातचीत;
हमारी ग्राहक सेवा के साथ आपकी बातचीत का विवरण, जैसे हमसे संपर्क करने की तारीख, समय और कारण, किसी भी चैट वार्तालाप की प्रतिलिपि, और यदि आप हमें कॉल करते हैं, तो आपका फ़ोन नंबर और कॉल रिकॉर्डिंग;
डिवाइस आईडी या अन्य विशिष्ट पहचानकर्ता, जिसमें आपके नेटवर्क डिवाइस (जैसे आपका राउटर) और आपके नेटवर्क पर नेटफ्लिक्स सक्षम डिवाइस शामिल हैं;
रीसेट करने योग्य डिवाइस पहचानकर्ता (विज्ञापन पहचानकर्ता के रूप में भी जाना जाता है), जैसे कि मोबाइल डिवाइस, टैबलेट और स्ट्रीमिंग मीडिया डिवाइस पर ऐसे पहचानकर्ता शामिल होते हैं (अधिक जानकारी के लिए नीचे "कुकीज़ और इंटरनेट विज्ञापन" अनुभाग देखें);
डिवाइस और सॉफ़्टवेयर विशेषताएँ (जैसे प्रकार और कॉन्फ़िगरेशन), प्रकार सहित कनेक्शन जानकारी (वाईफ़ाई, सेल्युलर), पेज व्यू पर आँकड़े, रेफ़रिंग स्रोत (उदाहरण के लिए, रेफ़रल यूआरएल), आईपी एड्रेस (जिसका उपयोग हमें आपका सामान्य स्थान बताने के लिए किया जा सकता है) , जैसे कि आपका शहर, राज्य/प्रांत और डाक कोड), ब्राउज़र और मानक वेब सर्वर लॉग जानकारी;
कुकीज़, वेब बीकन और अन्य प्रौद्योगिकियों के उपयोग के माध्यम से एकत्रित की गई जानकारी, जिसमें विज्ञापन जानकारी (जैसे विज्ञापनों की उपलब्धता और वितरण, साइट यूआरएल, साथ ही दिनांक और समय पर जानकारी) शामिल है। (अधिक जानकारी के लिए हमारा "कुकीज़ और इंटरनेट विज्ञापन" अनुभाग देखें।)
भागीदारों से जानकारी: हम अन्य कंपनियों से जानकारी एकत्र करते हैं जिनके साथ आपका संबंध है ("साझेदार")। इन साझेदारों में शामिल हो सकते हैं (आप किन सेवाओं का उपयोग करते हैं इसके आधार पर): आपका टीवी या इंटरनेट सेवा प्रदाता, या अन्य स्ट्रीमिंग मीडिया डिवाइस प्रदाता जो हमारी सेवा को अपने डिवाइस पर उपलब्ध कराते हैं; मोबाइल फोन वाहक या अन्य कंपनियां जो आपको सेवाएं प्रदान करती हैं और हमें वितरण के लिए नेटफ्लिक्स सेवा के लिए भुगतान एकत्र करती हैं या नेटफ्लिक्स सेवा के लिए प्री-पेड प्रचार प्रदान करती हैं; और वॉयस असिस्टेंट प्लेटफ़ॉर्म प्रदाता जो वॉयस कमांड के माध्यम से हमारी सेवा के साथ बातचीत को सक्षम बनाते हैं। साझेदार हमें जो जानकारी प्रदान करते हैं वह साझेदार सेवाओं की प्रकृति के आधार पर भिन्न होती है, और इसमें शामिल हो सकते हैं:
नेटफ्लिक्स पर लागू खोज क्वेरी और कमांड जो आप पार्टनर डिवाइस या वॉयस असिस्टेंट प्लेटफॉर्म के माध्यम से बनाते हैं;
सेवा सक्रियण जानकारी जैसे आपका ईमेल पता या अन्य संपर्क जानकारी;
आईपी ​​पते, डिवाइस आईडी या अन्य विशिष्ट पहचानकर्ता, साथ ही संबंधित प्री-पेड प्रमोशन, बिलिंग और उपयोगकर्ता इंटरफ़ेस जानकारी, जो उपयोगकर्ता प्रमाणीकरण, नेटफ्लिक्स सेवा पंजीकरण अनुभव, पार्टनर भुगतान प्रसंस्करण और भागों के माध्यम से आपके लिए नेटफ्लिक्स सामग्री की प्रस्तुति का समर्थन करते हैं। पार्टनर यूजर इंटरफ़ेस का.
अन्य स्रोतों से जानकारी: हम अन्य स्रोतों से भी जानकारी प्राप्त करते हैं। हम इस गोपनीयता कथन में वर्णित प्रथाओं के साथ-साथ सूचना के स्रोत द्वारा लगाए गए किसी भी अतिरिक्त प्रतिबंध के अनुसार इस जानकारी की रक्षा करते हैं ये स्रोत समय के साथ बदलते रहते हैं, लेकिन इनमें शामिल हो सकते हैं:
सेवा प्रदाता जो हमारी सेवा को अनुकूलित करने और इस गोपनीयता कथन के अनुरूप अन्य उपयोगों के लिए आपके आईपी पते के आधार पर स्थान निर्धारित करने में हमारी सहायता करते हैं;
सुरक्षा सेवा प्रदाता जो हमें हमारे सिस्टम को सुरक्षित करने, धोखाधड़ी को रोकने और नेटफ्लिक्स खातों की सुरक्षा की रक्षा करने में मदद करने के लिए जानकारी प्रदान करते हैं;
भुगतान सेवा प्रदाता जो हमें आपके साथ अपने संबंधों के आधार पर भुगतान या शेष राशि की जानकारी, या उस जानकारी के अपडेट प्रदान करते हैं;
सार्वजनिक रूप से उपलब्ध स्रोत जैसे सोशल मीडिया प्लेटफ़ॉर्म पर सार्वजनिक रूप से उपलब्ध पोस्ट और इंटरनेट सेवा प्रदाताओं (आईएसपी) के साथ आईपी पते को जोड़ने वाले सार्वजनिक डेटाबेस के माध्यम से उपलब्ध जानकारी;
तृतीय पक्ष सेवाएँ जिनमें आपने साइन इन किया है और जो नेटफ्लिक्स गेम के भीतर मल्टीप्लेयर गेमप्ले, लीडरबोर्ड और गेम सेविंग विकल्प जैसे कार्य प्रदान करती हैं।
सूचना का उपयोग
हम जानकारी का उपयोग आपकी सेवाओं और विपणन प्रयासों को प्रदान करने, विश्लेषण करने, प्रशासन करने, बढ़ाने और वैयक्तिकृत करने, आपके पंजीकरण, आपके आदेशों और आपके भुगतानों को संसाधित करने और इन और अन्य विषयों पर आपके साथ संवाद करने के लिए करते हैं। उदाहरण के लिए, हम ऐसी जानकारी का उपयोग इसके लिए करते हैं:

आपको फिल्मों, टीवी शो और गेम के लिए अनुकूलित और वैयक्तिकृत देखने की सिफारिशें प्रदान करें जो हमें लगता है कि आपकी रुचि के होंगे (सामूहिक रूप से "सामग्री");
अपना सामान्य भौगोलिक स्थान निर्धारित करें (जैसे आपका शहर, राज्य/प्रांत और डाक कोड);
स्थानीयकृत सामग्री प्रदान करें;
आपके लिए नेटवर्क समस्या निवारण का समर्थन करने के लिए अपना आईएसपी निर्धारित करें (हम परिचालन और व्यावसायिक उद्देश्यों के लिए समग्र आईएसपी जानकारी का भी उपयोग करते हैं);
पूछताछ और अनुरोधों का त्वरित और कुशलतापूर्वक जवाब देने में हमारी सहायता करें;
नेटफ्लिक्स सेवा को सदस्यों के लिए उपलब्ध कराने और गैर सदस्यों को नेटफ्लिक्स सेवा की उपलब्धता के बारे में जानकारी प्रदान करने के लिए पार्टनर के साथ समन्वय करना, पार्टनर के साथ आपके विशिष्ट संबंध के आधार पर;
हमारे सिस्टम को सुरक्षित करें, धोखाधड़ी को रोकें और नेटफ्लिक्स खातों की सुरक्षा की रक्षा करने में हमारी सहायता करें;
धोखाधड़ी सहित संभावित रूप से निषिद्ध या अवैध गतिविधियों को रोकना, पता लगाना और जांच करना, और हमारी शर्तों को लागू करना (जैसे कि यह निर्धारित करना कि क्या और किस नेटफ्लिक्स साइनअप ऑफर के लिए आप पात्र हैं और यह निर्धारित करना कि क्या किसी विशेष डिवाइस को हमारी शर्तों के अनुरूप खाते का उपयोग करने की अनुमति है या नहीं) उपयोग);
हमारे दर्शकों का विश्लेषण करें और समझें, हमारी सेवा में सुधार करें (हमारे उपयोगकर्ता इंटरफ़ेस अनुभव और सेवा प्रदर्शन सहित) और सामग्री चयन, अनुशंसा एल्गोरिदम और वितरण को अनुकूलित करें;
हमारी सेवा के संबंध में आपसे संवाद करें ताकि हम आपको नेटफ्लिक्स के बारे में समाचार, नेटफ्लिक्स पर उपलब्ध नई सुविधाओं और सामग्री के बारे में विवरण, विशेष ऑफ़र, प्रचार घोषणाएं, उपभोक्ता सर्वेक्षण, और पासवर्ड रीसेट अनुरोध जैसे परिचालन अनुरोधों में आपकी सहायता कर सकें। ये संचार विभिन्न तरीकों से हो सकते हैं, जैसे ईमेल, पुश नोटिफिकेशन, टेक्स्ट संदेश, ऑनलाइन मैसेजिंग चैनल और मिलान पहचानकर्ता संचार (नीचे वर्णित)। अपनी संचार प्राथमिकताओं को कैसे सेट करें या बदलें, यह जानने के लिए कृपया इस गोपनीयता कथन का "आपकी पसंद" अनुभाग देखें।
हमारी सामग्री अनुशंसा प्रणाली यह अनुमान लगाने का प्रयास करती है कि जब आप लॉग इन करेंगे तो आप क्या देखने के मूड में होंगे। हालाँकि, हमारी सामग्री अनुशंसा प्रणाली आपके लिए सामाजिक-जनसांख्यिकीय जानकारी (जैसे लिंग या नस्ल) का अनुमान या संलग्न नहीं करती है। हमारे पास एक सहायता लेख है जो बताता है कि हमारी सामग्री अनुशंसा प्रणाली कैसे काम करती है - स्पॉइलर: इन अनुशंसाओं का सबसे बड़ा चालक वह है जो आप वास्तव में हमारी सेवा के माध्यम से देखना चुनते हैं। आप लेख netfly.com/recommendations पर पढ़ सकते हैं।

जानकारी के प्रकटीकरण

हम आपकी जानकारी को कुछ उद्देश्यों के लिए और तीसरे पक्ष को प्रकट करते हैं, जैसा कि नीचे बताया गया है:

नेटफ्लिक्स परिवार की कंपनियां: हम आपकी जानकारी नेटफ्लिक्स परिवार की कंपनियों (help.netfly.com/legal/corpinfo) के बीच आवश्यकतानुसार साझा करते हैं: आपको हमारी सेवाओं तक पहुंच प्रदान करना; ग्राहक सहायता प्रदान करना; सेवा सुधार के बारे में निर्णय लेना; सामग्री विकास; और इस गोपनीयता कथन के सूचना के उपयोग अनुभाग में वर्णित अन्य उद्देश्यों के लिए।
सेवा प्रदाता: हम अपनी ओर से सेवाएँ प्रदान करने या आपको सेवाएँ प्रदान करने में हमारी सहायता करने के लिए अन्य कंपनियों, एजेंटों या ठेकेदारों ("सेवा प्रदाता") का उपयोग करते हैं। उदाहरण के लिए, हम विपणन, विज्ञापन, संचार, सुरक्षा, बुनियादी ढांचे और आईटी सेवाएं प्रदान करने, हमारी सेवा को अनुकूलित, वैयक्तिकृत और अनुकूलित करने, क्रेडिट कार्ड लेनदेन या अन्य भुगतान विधियों को संसाधित करने, बैंक खाते या शेष राशि की जानकारी प्रदान करने के लिए सेवा प्रदाताओं को नियुक्त करते हैं। ग्राहक सेवा प्रदान करना, जानकारी का विश्लेषण करना और उसे बढ़ाना (हमारी सेवा के साथ उपयोगकर्ताओं की बातचीत के बारे में जानकारी सहित), और उपभोक्ता सर्वेक्षणों को संसाधित और प्रशासित करना। ऐसी सेवाएँ प्रदान करने के दौरान, इन सेवा प्रदाताओं के पास आपकी व्यक्तिगत या अन्य जानकारी तक पहुँच हो सकती है। हम उन्हें अपनी सेवाएं प्रदान करने के अलावा आपकी व्यक्तिगत जानकारी का उपयोग करने या प्रकट करने के लिए अधिकृत नहीं करते हैं (जिसमें मुख्य जानकारी भी शामिल है)।(उनकी सेवाओं में सुधार करना और उनमें सुधार करना)।
साझेदार: जैसा कि ऊपर बताया गया है, आपका हमारे एक या अधिक साझेदारों के साथ संबंध हो सकता है, ऐसी स्थिति में हम सदस्यों को नेटफ्लिक्स सेवा प्रदान करने और इसकी उपलब्धता के बारे में जानकारी प्रदान करने के लिए उनके साथ समन्वय स्थापित करने के लिए उनके साथ कुछ जानकारी साझा कर सकते हैं। नेटफ्लिक्स सेवा। उदाहरण के लिए, आप किन भागीदार सेवाओं का उपयोग करते हैं, इसके आधार पर हम जानकारी साझा कर सकते हैं:
हमें वितरण के लिए नेटफ्लिक्स सेवा के लिए पार्टनर प्री-पेड प्रमोशन या भुगतान संग्रह की सुविधा प्रदान करने के लिए;
उन साझेदारों के साथ जो वॉयस असिस्टेंट प्लेटफॉर्म संचालित करते हैं जो आपको वॉयस कमांड का उपयोग करके हमारी सेवा के साथ बातचीत करने की अनुमति देते हैं;
ताकि नेटफ्लिक्स सेवा में उपलब्ध सामग्री और सुविधाओं को पार्टनर के यूजर इंटरफेस में आपको सुझाया जा सके। सदस्यों के लिए, ये सुझाव नेटफ्लिक्स सेवा का हिस्सा हैं और इसमें अनुकूलित और व्यक्तिगत देखने की सिफारिशें शामिल हो सकती हैं।
प्रचार प्रस्ताव: हम संयुक्त प्रचार या कार्यक्रम पेश कर सकते हैं, जिसमें आपकी भागीदारी के लिए हमें आपकी जानकारी तीसरे पक्ष के साथ साझा करने की आवश्यकता होगी। इस प्रकार के प्रमोशन को पूरा करने में, हम प्रोत्साहन को पूरा करने के संबंध में आपका नाम और अन्य जानकारी साझा कर सकते हैं। कृपया ध्यान दें कि ये तृतीय पक्ष अपनी गोपनीयता प्रथाओं के लिए स्वयं जिम्मेदार हैं।
नेटफ्लिक्स और अन्य की सुरक्षा: नेटफ्लिक्स और उसके सेवा प्रदाता आपकी व्यक्तिगत और अन्य जानकारी का खुलासा कर सकते हैं और अन्यथा उसका उपयोग कर सकते हैं, जहां हम या वे उचित रूप से मानते हैं कि इस तरह के प्रकटीकरण की आवश्यकता है (ए) किसी भी लागू कानून, विनियमन, कानूनी प्रक्रिया या सरकारी अनुरोध को संतुष्ट करने के लिए, ( बी) संभावित उल्लंघनों की जांच सहित उपयोग की लागू शर्तों को लागू करना, (सी) अवैध या संदिग्ध अवैध गतिविधियों (भुगतान धोखाधड़ी सहित), सुरक्षा या तकनीकी मुद्दों का पता लगाना, रोकना या अन्यथा संबोधित करना, या (डी) नुकसान से बचाना नेटफ्लिक्स, उसके उपयोगकर्ताओं या जनता के अधिकार, संपत्ति या सुरक्षा, जैसा कि कानून द्वारा आवश्यक या अनुमति है।
व्यावसायिक स्थानांतरण: किसी भी पुनर्गठन, पुनर्गठन, विलय या बिक्री, या परिसंपत्तियों के अन्य हस्तांतरण के संबंध में, हम व्यक्तिगत जानकारी सहित जानकारी स्थानांतरित करेंगे, बशर्ते कि प्राप्तकर्ता पक्ष आपकी व्यक्तिगत जानकारी का इस तरह से सम्मान करने के लिए सहमत हो जो हमारी गोपनीयता के अनुरूप हो। कथन।
जब भी जानकारी साझा करने के दौरान हम व्यक्तिगत जानकारी अन्य देशों में स्थानांतरित करते हैं तो हम यह सुनिश्चित करेंगे कि जानकारी इस गोपनीयता कथन के अनुसार और डेटा संरक्षण पर लागू कानूनों द्वारा अनुमति के अनुसार स्थानांतरित की जाए। आप इस लिंक पर इस बारे में अधिक जानकारी प्राप्त कर सकते हैं कि हम आपकी व्यक्तिगत जानकारी को अंतरराष्ट्रीय स्तर पर कैसे प्रकट और स्थानांतरित करते हैं: help.netfly.com/legal/personal-information-international-transfers।

आप निम्नलिखित तरीकों से भी अपनी जानकारी का खुलासा करना चुन सकते हैं:

हमारी सेवा के कुछ हिस्सों में एक टूल शामिल हो सकता है जो आपको अपने स्मार्ट डिवाइस पर क्लाइंट और एप्लिकेशन का उपयोग करके ईमेल, टेक्स्ट संदेश और सामाजिक या अन्य साझाकरण एप्लिकेशन द्वारा जानकारी साझा करने का विकल्प देता है;
सामाजिक प्लगइन्स और समान प्रौद्योगिकियाँ आपको जानकारी साझा करने की अनुमति देती हैं; और
नेटफ्लिक्स गेम सुविधाओं के माध्यम से, जैसे मल्टीप्लेयर विकल्प और लीडरबोर्ड।
सामाजिक प्लगइन्स और सामाजिक एप्लिकेशन स्वयं सामाजिक नेटवर्क द्वारा संचालित होते हैं, और उनकी उपयोग की शर्तों और गोपनीयता नीतियों के अधीन होते हैं। इसी तरह, ऊपर उल्लिखित कुछ नेटफ्लिक्स गेम सुविधाओं (जैसे मल्टीप्लेयर गेमप्ले, लीडरबोर्ड और गेम सेविंग विकल्प) के लिए तीसरे पक्ष की सेवा के उपयोग की आवश्यकता हो सकती है, जो उस सेवा की उपयोग की शर्तों और गोपनीयता नीति के अधीन है।

खाते और प्रोफ़ाइल तक पहुंच
"मुझे याद रखें" फ़ंक्शन: अपने खाते तक पहुंच में आसानी के लिए, आप वेबसाइट पर लॉग इन करते समय "मुझे इस डिवाइस पर याद रखें" फ़ंक्शन का उपयोग कर सकते हैं। यह फ़ंक्शन उस तकनीक का उपयोग करता है जो हमें सीधे खाते तक पहुंच प्रदान करने और आपके ब्राउज़र द्वारा सेवा पर दोबारा आने पर किसी भी पासवर्ड या अन्य उपयोगकर्ता पहचान की पुनः प्रविष्टि की आवश्यकता के बिना नेटफ्लिक्स सेवा को प्रशासित करने में मदद करने में सक्षम बनाता है।
दूसरों को अपने खाते तक पहुंच प्रदान करना: यदि आप दूसरों को अपने खाते तक पहुंच साझा करते हैं या अन्यथा अनुमति देते हैं, तो वे आपके द्वारा देखे गए शो, रेटिंग, खाता जानकारी (आपके ईमेल पते या "खाता" क्षेत्र में अन्य जानकारी सहित) देख पाएंगे हमारी वेबसाइट), और गेम से संबंधित जानकारी (जैसे कि आपका इन-गेम नाम और सहेजी गई गेम प्रगति)। यदि आप हमारी प्रोफ़ाइल सुविधा का उपयोग करते हैं तो भी यह सत्य रहता है। आपके पास नेटफ्लिक्स मोबाइल ऐप के माध्यम से सहज खाता लॉगिन का उपयोग करने का विकल्प हो सकता है, जो स्मार्ट टीवी, सेट टॉप बॉक्स और जिस नेटवर्क से आप जुड़े हुए हैं उस पर अन्य स्ट्रीमिंग मीडिया उपकरणों पर नेटफ्लिक्स ऐप में लॉगिन करने में सक्षम बनाता है। यदि आप उस सुविधा का उपयोग करते हैं, तो वे डिवाइस आपके खाते में साइन इन रहेंगे, जब तक कि आप बाद में उन डिवाइस से लॉग आउट न कर दें।
प्रोफ़ाइल: प्रोफ़ाइल उपयोगकर्ताओं को एक विशिष्ट, वैयक्तिकृत नेटफ्लिक्स अनुभव प्राप्त करने की अनुमति देती है, जो उनकी रुचि की फिल्मों और शो के साथ-साथ अलग-अलग देखने के इतिहास पर आधारित होती है। कृपया ध्यान दें कि प्रोफ़ाइल उन सभी के लिए उपलब्ध हैं जो आपके नेटफ्लिक्स खाते का उपयोग करते हैं, ताकि आपके पास पहुंच रखने वाला कोई भी व्यक्ति नेटफ्लिक्स अकाउंट पर नेविगेट किया जा सकता है और प्रोफाइल का उपयोग, संपादन या डिलीट किया जा सकता है। आपको इसे अपने खाते तक पहुंच रखने वाले अन्य लोगों को समझाना चाहिए, और यदि आप नहीं चाहते कि वे आपकी प्रोफ़ाइल का उपयोग करें या उसे बदलें, तो उन्हें अवश्य बताएं। प्रोफ़ाइल उपयोगकर्ताओं को प्रोफ़ाइल में एक ईमेल पता, फ़ोन नंबर या अन्य जानकारी जोड़ने का अवसर दिया जा सकता है और ऐसी जानकारी के अनुरोध के समय संग्रह और उपयोग की सूचना प्रदान की जाएगी (प्रोफ़ाइल गोपनीयता नोटिस लागू होता है (help.netfly.com) /कानूनी/प्रोफ़ाइलगोपनीयता)). हमारे पास विभिन्न अभिभावकीय नियंत्रण उपलब्ध हैं, आप help.netfly.com/node/264 पर स्थित हमारे सहायता लेख को पढ़कर अधिक जान सकते हैं।
प्रोफ़ाइल स्थानांतरण: आपके खाते पर प्रोफ़ाइल स्थानांतरण सुविधा आपको और आपके खाते तक पहुंच रखने वाले उपयोगकर्ताओं को आपके खाते से एक योग्य प्रोफ़ाइल को एक अलग खाते में स्थानांतरित करने की अनुमति देती है (इतिहास और अनुशंसाओं को देखने जैसी जानकारी सहित)। आप अपने खाता पृष्ठ के सेटिंग अनुभाग में इस सुविधा के लिए सेटिंग बदल सकते हैं। आप help.netfly.com/node/122698 पर स्थित हमारे सहायता लेख को पढ़कर अधिक जान सकते हैं।
अपने नेटफ्लिक्स खाते से डिवाइस एक्सेस हटाना: अपने डिवाइस से अपने नेटफ्लिक्स खाते तक पहुंच हटाने के लिए, हमारी वेबसाइट के "खाता" अनुभाग पर जाएं, "सभी डिवाइस से साइन आउट करें" चुनें और अपने डिवाइस को निष्क्रिय करने के लिए निर्देशों का पालन करें (नोट, निष्क्रियकरण) तुरंत घटित नहीं हो सकता)। जहां संभव हो, सार्वजनिक या साझा उपकरणों के उपयोगकर्ताओं को प्रत्येक विज़िट के पूरा होने पर लॉग आउट करना चाहिए। यदि आप कंप्यूटर या नेटफ्लिक्स तैयार डिवाइस बेचते हैं या वापस करते हैं, तो आपको ऐसा करने से पहले लॉग आउट करना चाहिए और डिवाइस को निष्क्रिय कर देना चाहिए। यदि आप अपने पासवर्ड या डिवाइस की सुरक्षा बनाए नहीं रखते हैं, या अपने डिवाइस को लॉग आउट या निष्क्रिय करने में विफल रहते हैं, तो बाद के उपयोगकर्ता आपकी व्यक्तिगत जानकारी सहित आपके खाते तक पहुंचने में सक्षम हो सकते हैं।
तुम्हारी पसंद
ईमेल और पाठ संदेश. यदि आप अब ईमेल या टेक्स्ट संदेश के माध्यम से हमसे कुछ संचार प्राप्त नहीं करना चाहते हैं, तो बस हमारी वेबसाइट के "खाता" अनुभाग में "संचार सेटिंग्स" विकल्प तक पहुंचें और सदस्यता समाप्त करने के लिए उन वस्तुओं को अनचेक करें। वैकल्पिक रूप से, ईमेल में "सदस्यता समाप्त करें" लिंक पर क्लिक करें या टेक्स्ट संदेश में STOP (या अन्यथा निर्देशानुसार) उत्तर दें। कृपया ध्यान दें कि आप हमसे सेवा-संबंधित पत्राचार, जैसे आपके खाते के लेनदेन से संबंधित संदेश, की सदस्यता समाप्त नहीं कर सकते।

सूचनाएं धक्का। आप नेटफ्लिक्स से मोबाइल पुश नोटिफिकेशन प्राप्त करना चुन सकते हैं। कुछ डिवाइस ऑपरेटिंग सिस्टम पर, आप स्वचालित रूप से सूचनाओं में नामांकित हो जाएंगे। यदि आप बाद में निर्णय लेते हैं कि आप अब ये सूचनाएं प्राप्त नहीं करना चाहते हैं, तो आप उन्हें बंद करने के लिए अपने मोबाइल डिवाइस की सेटिंग कार्यक्षमता का उपयोग कर सकते हैं। हम कुछ वेब ब्राउज़रों पर पुश सूचनाएँ भी प्रदान करते हैं। यदि आप उन सूचनाओं को प्राप्त करने के लिए सहमत हैं और बाद में निर्णय लेते हैं कि आप अब इन सूचनाओं को प्राप्त नहीं करना चाहते हैं, तो आप उन्हें बंद करने के लिए अपने ब्राउज़र की सेटिंग्स का उपयोग कर सकते हैं।

नेटफ्लिक्स से मेल खाने वाला पहचानकर्ता संचार। कुछ तृतीय पक्ष साइटें और ऐप्स हमें तृतीय पक्ष को गोपनीयता सुरक्षा पहचानकर्ता भेजकर हमारे शीर्षकों और सेवाओं के बारे में ऑनलाइन प्रचार के साथ अपने उपयोगकर्ताओं तक पहुंचने की अनुमति देते हैं। गोपनीयता सुरक्षात्मक पहचानकर्ता का अर्थ है कि हम मूल जानकारी (जैसे ईमेल पता या फोन नंबर) को प्रकट होने से बचाने के लिए मूल जानकारी को एक मूल्य में परिवर्तित करते हैं। तीसरा पक्ष गोपनीयता सुरक्षात्मक पहचानकर्ता की तुलना अपने डेटाबेस में पहचानकर्ताओं से करता है और मिलान तभी होगा जब आपने नेटफ्लिक्स और तीसरे पक्ष के साथ एक ही पहचानकर्ता (जैसे ईमेल पता) का उपयोग किया हो। यदि कोई मेल है, तो नेटफ्लिक्स यह चुन सकता है कि उस तृतीय पक्ष साइट या ऐप पर आपको दिया गया प्रचार संचार भेजा जाए या नहीं, और ऑनलाइन विज्ञापन की प्रभावशीलता को अनुकूलित और बेहतर ढंग से माप सकता है। आप हमारी वेबसाइट के "खाता" अनुभाग के "विपणन संचार" अनुभाग से बाहर निकल सकते हैं।

व्यवहारिक विज्ञापन. व्यवहार संबंधी विज्ञापन वे होते हैं जिनका चयन आपके उपयोग और/या इंटरनेट पर विभिन्न असंबद्ध तृतीय पक्ष ऐप्स या वेबसाइटों (व्यवहार विज्ञापन) के साथ बातचीत के आधार पर किया जाता है। नेटफ्लिक्स व्यवहारिक विज्ञापन का उपयोग करके अपनी सेवाओं का विज्ञापन कर सकता है, और यदि आप ब्राउज़र का उपयोग कर रहे हैं, तो आपकी संभावित रुचियों को निर्धारित करने में सहायता के लिए जानकारी एकत्र करने के लिए कुछ कुकीज़ और वेब बीकन का उपयोग किया जा सकता है। यदि आप एक मोबाइल डिवाइस, टैबलेट, या स्ट्रीमिंग मीडिया डिवाइस का उपयोग कर रहे हैं जिसमें रीसेट करने योग्य डिवाइस पहचानकर्ता शामिल है, तो उस पहचानकर्ता का उपयोग आपके संभावित हितों को निर्धारित करने में सहायता के लिए किया जा सकता है। नेटफ्लिक्स के व्यावहारिक विज्ञापनों के बारे में अपनी पसंद के लिए, कृपया "कुकीज़ और इंटरनेट विज्ञापन" अनुभाग (नीचे) देखें।

कुकीज़ और इंटरनेट विज्ञापन
हम और हमारे सेवा प्रदाता विभिन्न कारणों से कुकीज़ और अन्य तकनीकों (जैसे वेब बीकन) के साथ-साथ रीसेट करने योग्य डिवाइस पहचानकर्ताओं का उपयोग करते हैं। हम चाहते हैं कि आप इन तकनीकों के हमारे उपयोग के बारे में सूचित हों, इसलिए यह अनुभाग बताता है कि हम किस प्रकार की तकनीकों का उपयोग करते हैं, वे क्या करते हैं, और उनके उपयोग के संबंध में आपकी पसंद क्या है।

कुकीज़ और समान प्रौद्योगिकियाँ, वेब बीकन, और रीसेट करने योग्य डिवाइस पहचानकर्ता

कुकीज़ sma हैंजब आप वेबसाइटों और ऑनलाइन सेवाओं को ब्राउज़ और उपयोग करते हैं तो वे डेटा फ़ाइलें आमतौर पर आपके डिवाइस पर संग्रहीत होती हैं। हम अन्य तकनीकों जैसे ब्राउज़र स्टोरेज और प्लगइन्स (जैसे, HTML5, IndexedDB और WebSQL) का उपयोग करते हैं। कुकीज़ की तरह, ये अन्य प्रौद्योगिकियाँ आपके डिवाइस पर थोड़ी मात्रा में डेटा संग्रहीत कर सकती हैं। वेब बीकन (जिन्हें स्पष्ट GIF या पिक्सेल टैग के रूप में भी जाना जाता है) अक्सर कुकीज़ के साथ मिलकर काम करते हैं। कई मामलों में, कुकीज़ में गिरावट उन कुकीज़ से जुड़े वेब बीकन की प्रभावशीलता को ख़राब कर देगी।

यदि आप मोबाइल डिवाइस, टैबलेट या स्ट्रीमिंग मीडिया डिवाइस पर नेटफ्लिक्स ऐप का उपयोग करते हैं, तो हम आपके डिवाइस से एक रीसेट करने योग्य डिवाइस पहचानकर्ता एकत्र कर सकते हैं। रीसेट करने योग्य डिवाइस पहचानकर्ता (विज्ञापन पहचानकर्ता के रूप में भी जाना जाता है) कुकीज़ के समान होते हैं और कई मोबाइल उपकरणों और टैबलेट पर पाए जाते हैं (उदाहरण के लिए, ऐप्पल आईओएस उपकरणों पर "विज्ञापनदाताओं के लिए पहचानकर्ता" (या आईडीएफए) और एंड्रॉइड पर "Google विज्ञापन आईडी" डिवाइस), और कुछ स्ट्रीमिंग मीडिया डिवाइस। कुकीज़ की तरह, रीसेट करने योग्य डिवाइस पहचानकर्ताओं का उपयोग ऑनलाइन विज्ञापन को अधिक प्रासंगिक बनाने और विश्लेषण और अनुकूलन उद्देश्यों के लिए किया जाता है।

नेटफ्लिक्स इन तकनीकों का उपयोग क्यों करता है?

हम विभिन्न कारणों से इस प्रकार की प्रौद्योगिकियों का उपयोग करते हैं, जैसे आपके लौटने पर आपको याद करके हमारी सेवाओं तक पहुंच को आसान बनाना; हमारी सेवाएँ प्रदान करना, विश्लेषण करना, समझना और उनका उपयोग बढ़ाना; हमारी शर्तों को लागू करना, धोखाधड़ी को रोकना; साइट के प्रदर्शन को बेहतर बनाने, हमारी साइट पर विज़िटर ट्रैफ़िक और गतिविधियों की निगरानी करने के लिए; और हमारी मार्केटिंग या विज्ञापन को वितरित और तैयार करना, और तीसरे पक्ष की साइटों पर हमारे ईमेल, मार्केटिंग और ऑनलाइन विज्ञापनों के साथ इंटरैक्शन को समझना।

आपको यह बेहतर ढंग से समझने में मदद के लिए कि हम कुकीज़ और रीसेट करने योग्य डिवाइस पहचानकर्ताओं का उपयोग कैसे करते हैं, कृपया नीचे दी गई जानकारी देखें:

आवश्यक कुकीज़: ये कुकीज़ हमारी वेबसाइट या ऑनलाइन सेवा प्रदान करने के लिए अत्यंत आवश्यक हैं। उदाहरण के लिए, हम और हमारे सेवा प्रदाता इन कुकीज़ का उपयोग हमारे सदस्यों को प्रमाणित करने और पहचानने के लिए कर सकते हैं जब वे हमारी वेबसाइटों और एप्लिकेशन का उपयोग करते हैं ताकि हम उन्हें अपनी सेवा प्रदान कर सकें। वे हमारी उपयोग की शर्तों को लागू करने, धोखाधड़ी को रोकने और हमारी सेवा की सुरक्षा बनाए रखने में भी हमारी मदद करते हैं।
प्रदर्शन और कार्यक्षमता कुकीज़: ये कुकीज़ हमें नेटफ्लिक्स के साथ आपके ऑनलाइन अनुभव को अनुकूलित और बढ़ाने में मदद करती हैं। उदाहरण के लिए, वे हमें आपकी प्राथमिकताओं को याद रखने में मदद करते हैं और आपको पहले प्रदान की गई जानकारी को दोबारा दर्ज करने की आवश्यकता से रोकते हैं (उदाहरण के लिए, सदस्य साइन अप के दौरान)। हम इन कुकीज़ का उपयोग अपने आगंतुकों द्वारा नेटफ्लिक्स सेवा के उपयोग के बारे में जानकारी (जैसे लोकप्रिय पेज, रूपांतरण दर, देखने के पैटर्न, क्लिक-थ्रू और अन्य जानकारी) एकत्र करने के लिए भी करते हैं ताकि हम अपनी वेबसाइट और सेवा को बढ़ा सकें और वैयक्तिकृत कर सकें और बाजार का संचालन कर सकें। अनुसंधान। इस प्रकार की कुकीज़ को हटाने से हमारी सेवा की कार्यक्षमता सीमित हो सकती है।
विज्ञापन कुकीज़ और रीसेट करने योग्य डिवाइस पहचानकर्ता: ये कुकीज़ और रीसेट करने योग्य डिवाइस पहचानकर्ता इस और अन्य वेबसाइटों और ऐप्स के आपके उपयोग, विज्ञापनों और ईमेल पर आपकी प्रतिक्रिया के बारे में जानकारी का उपयोग करते हैं, और ऐसे विज्ञापन वितरित करते हैं जो आपके लिए और विश्लेषण और अनुकूलन उद्देश्यों के लिए अधिक प्रासंगिक हैं।
जब हम अन्य वेबसाइटों या ऐप्स पर अपनी सेवाओं का विज्ञापन करते हैं, तो कुछ वेबसाइटें और ऐप्स जहां हम विज्ञापन करते हैं, साथ ही विज्ञापन प्रौद्योगिकी कंपनियां जिनका उपयोग हम अपने विज्ञापनों को खरीदने, वितरित करने, अनुकूलित करने और/या मापने के लिए करते हैं (सामूहिक रूप से "विज्ञापन भागीदार") , हमारे अभियान लक्ष्यीकरण, माप और अनुकूलन के हिस्से के रूप में हमसे जानकारी प्राप्त कर सकता है (उदाहरण के लिए, साइन-अप और साइट विज़िट या ऐप ओपन/इंस्टॉल जानकारी में पूर्ण किए गए चरण)। इस प्रकार की जानकारी का सामान्य उपयोग विज्ञापन अभियानों की प्रभावशीलता का आकलन करना और उन्हें अनुकूलित करना है, जिससे विज्ञापन भागीदारों को यह देखने की अनुमति मिलती है कि विज्ञापन देखने वाले किसी व्यक्ति ने बाद में हमारी सेवा के लिए साइन अप किया था। एक अन्य सामान्य उपयोग यह सुनिश्चित करना है कि हम उन लोगों को नेटफ्लिक्स सेवा के लिए साइन अप करने के लिए प्रेरित करने वाले विज्ञापन न दिखाएं, यदि वे पहले से ही नेटफ्लिक्स उपयोगकर्ता हैं। नेटफ्लिक्स विज्ञापन भागीदारों को आपके द्वारा किए गए विशिष्ट शीर्षक चयनों, आपके द्वारा उपयोग किए गए यूआरएल, या आपके द्वारा हमारी सेवा पर देखे गए शो के बारे में जानकारी तक पहुंचने से रोकने के लिए डिज़ाइन किए गए अनुबंधात्मक और तकनीकी उपायों का उपयोग करता है। हम शीर्षक चयन या आपके द्वारा हमारी सेवा पर देखे गए शो के बारे में जानकारी साझा नहीं करते हैं।

मैं इन प्रौद्योगिकियों के संबंध में चुनाव कैसे कर सकता हूं?

कुकीज़ के संबंध में चयन करना
हमारी वेबसाइट के माध्यम से सेट की गई कुकीज़ के बारे में अधिक जानकारी के लिए, साथ ही साथ अन्य प्रकार की ऑनलाइन ट्रैकिंग (समय के साथ आपकी ऑनलाइन गतिविधियों के बारे में तीसरे पक्ष द्वारा जानकारी का संग्रह और तीसरे पक्ष की वेबसाइटों या ऑनलाइन व्यवहारिक विज्ञापन के लिए ऑनलाइन सेवाओं सहित), और अभ्यास करने के लिए उनके संबंध में विकल्प, यहां क्लिक करें। इस समय, हम वेब ब्राउज़र के "ट्रैक न करें" संकेतों पर प्रतिक्रिया नहीं देते हैं।

रीसेट करने योग्य डिवाइस पहचानकर्ताओं के संबंध में चयन करना
मोबाइल डिवाइस, टैबलेट, या स्ट्रीमिंग मीडिया डिवाइस पर रीसेट करने योग्य डिवाइस पहचानकर्ता के संबंध में नेटफ्लिक्स के व्यवहारिक विज्ञापनों से ऑप्ट आउट करने के लिए, कृपया अपने डिवाइस पर उचित सेटिंग कॉन्फ़िगर करें (आमतौर पर "पी" के अंतर्गत पाया जाता है) आपके डिवाइस की सेटिंग्स में प्रतिद्वंद्विता" या "विज्ञापन")। आप अभी भी अपने डिवाइस पर नेटफ्लिक्स विज्ञापन देख सकते हैं, लेकिन उन्हें आपकी संभावित रुचियों के आधार पर नहीं चुना जाएगा।

अन्य प्रौद्योगिकियों के संबंध में चयन करना
कुकीज़ के समान प्रौद्योगिकियों के संबंध में चयन करने के कई तरीके हैं, जैसे ब्राउज़र स्टोरेज और प्लगइन्स (उदाहरण के लिए, HTML5, IndexedDB और WebSQL)। उदाहरण के लिए, कई लोकप्रिय ब्राउज़र आमतौर पर सेटिंग्स या प्राथमिकता क्षेत्र में ब्राउज़र स्टोरेज को साफ़ करने की क्षमता प्रदान करते हैं; अधिक जानने के लिए अपने ब्राउज़र का सहायता फ़ंक्शन या सहायता क्षेत्र देखें। अन्य तकनीकों, जैसे सिल्वरलाइट स्टोरेज, को एप्लिकेशन के भीतर से साफ़ किया जा सकता है।

आपकी जानकारी और अधिकार
आप अपनी व्यक्तिगत जानकारी तक पहुंच का अनुरोध कर सकते हैं, या हमारे पास आपके बारे में मौजूद पुरानी या गलत व्यक्तिगत जानकारी को सही या अपडेट कर सकते हैं। आप यह भी अनुरोध कर सकते हैं कि हम आपके बारे में हमारे पास मौजूद व्यक्तिगत जानकारी हटा दें।

जब आप हमारी वेबसाइट के "खाता" भाग पर जाते हैं, जहां आपके पास अपने खाते के बारे में विस्तृत जानकारी तक पहुंचने और अपडेट करने की क्षमता होती है, जिसमें आपकी संपर्क जानकारी, आपकी नेटफ्लिक्स भुगतान जानकारी और आपके खाते के बारे में विभिन्न संबंधित जानकारी (जैसे) शामिल हैं वह सामग्री जिसे आपने देखा और रेट किया है)। "खाता" अनुभाग तक पहुंचने के लिए आपको साइन इन होना होगा।

यदि आप खाता स्वामी हैं, तो अपनी व्यक्तिगत जानकारी की एक प्रति डाउनलोड करने के लिए यहां जाएं: netfly.com/account/getmyinfo ("खाता" अनुभाग तक पहुंचने के लिए आपको साइन इन करना होगा), और निर्देशों का पालन करें।

अन्य अनुरोधों के लिए, या यदि आपके पास हमारी गोपनीयता प्रथाओं के संबंध में कोई प्रश्न है, तो कृपया हमारे डेटा सुरक्षा अधिकारी/गोपनीयता कार्यालय से privacy@netfly.com पर संपर्क करें। हमारी सत्यापन प्रक्रिया सहित आपकी जानकारी तक पहुंचने के तरीके के बारे में अधिक जानकारी के लिए, कृपया इस सहायता लेख का संदर्भ लें: help.netfly.com/node/100624। हम लागू डेटा सुरक्षा कानूनों के अनुसार अपने डेटा सुरक्षा अधिकारों का प्रयोग करने के इच्छुक व्यक्तियों से प्राप्त सभी अनुरोधों का जवाब देते हैं। कृपया अपनी जानकारी के संबंध में अतिरिक्त विकल्पों के लिए इस गोपनीयता कथन का "आपकी पसंद" अनुभाग भी देखें।

हम उन अनुरोधों को अस्वीकार कर सकते हैं जो अनुचित हैं या कानून द्वारा आवश्यक नहीं हैं, जिनमें वे भी शामिल हैं जो बेहद अव्यवहारिक होंगे, जिनके लिए असंगत तकनीकी प्रयास की आवश्यकता हो सकती है, या हमें धोखाधड़ी को सक्षम करने जैसे परिचालन जोखिमों का सामना करना पड़ सकता है।

जानकारी का प्रतिधारण: हम अपने बिलिंग या रिकॉर्ड उद्देश्यों के लिए और इस गोपनीयता कथन में वर्णित उद्देश्यों को पूरा करने के लिए, आपकी पसंद का सम्मान करने सहित, लागू कानूनों और विनियमों द्वारा आवश्यक या अनुमति के अनुसार जानकारी को बनाए रख सकते हैं। विशेष रूप से, हम अपने वैध हितों और आवश्यक व्यावसायिक उद्देश्यों, जैसे हमारी सेवाओं का संचालन, रखरखाव और सुधार के लिए जानकारी बनाए रखते हैं; हमारे कानूनी दायित्वों का अनुपालन; और हमारे उपयोग की शर्तों को लागू करने सहित हमारे कानूनी अधिकारों और उपायों का प्रयोग करना। हमारी जानकारी को बनाए रखना कई कारकों पर आधारित है जैसे कि नेटफ्लिक्स के साथ आपका संबंध (उदाहरण के लिए, क्या आप नेटफ्लिक्स के वर्तमान सदस्य हैं); सूचना की प्रकृति; हमारे कानूनी दायित्वों का अनुपालन; वास्तविक या प्रत्याशित कानूनी दावों का बचाव या समाधान करना। हम व्यक्तिगत जानकारी को सुरक्षित तरीके से नष्ट करने या उसकी पहचान मिटाने के लिए उचित उपाय करते हैं जब इसकी आवश्यकता नहीं रह जाती है। जानकारी को हटाने, हटाने और बनाए रखने के बारे में जानकारी के लिए, कृपया इस सहायता लेख का संदर्भ लें: help.netfly.com/node/100625।

सुरक्षा
हम आपकी व्यक्तिगत जानकारी को हानि, चोरी और अनधिकृत पहुंच, उपयोग और संशोधन से सुरक्षित रखने के लिए उचित प्रशासनिक, तार्किक, भौतिक और प्रबंधकीय उपायों का उपयोग करते हैं। ये उपाय आपकी व्यक्तिगत जानकारी को संसाधित करने के जोखिमों के लिए उपयुक्त सुरक्षा स्तर प्रदान करने के लिए डिज़ाइन किए गए हैं।

अन्य वेबसाइटें, प्लेटफ़ॉर्म और एप्लिकेशन
नेटफ्लिक्स सेवा तीसरे पक्ष के प्लेटफार्मों द्वारा संचालित सुविधाओं (जैसे कि सोशल मीडिया सामग्री का प्रदर्शन, या आवाज नियंत्रण का प्रावधान) के माध्यम से प्रदान की जा सकती है और/या उपयोग की जा सकती है, या तीसरे पक्ष द्वारा संचालित साइटों के लिंक शामिल हो सकते हैं जिनकी प्रबंधन के संबंध में नीतियां जानकारी हमारी जानकारी से भिन्न हो सकती है. उदाहरण के लिए, आप गेमिंग सिस्टम, स्मार्ट टीवी, मोबाइल डिवाइस, सेट टॉप बॉक्स और कई अन्य इंटरनेट से जुड़े डिवाइस जैसे प्लेटफार्मों के माध्यम से नेटफ्लिक्स सेवा तक पहुंचने में सक्षम हो सकते हैं। इन वेबसाइटों और प्लेटफार्मों में अलग और स्वतंत्र गोपनीयता या डेटा नीतियां, गोपनीयता कथन, नोटिस और उपयोग की शर्तें हैं, जिन्हें हम अनुशंसा करते हैं कि आप ध्यान से पढ़ें। इसके अलावा, आपको ऐसे तृतीय पक्ष एप्लिकेशन का सामना करना पड़ सकता है जो नेटफ्लिक्स सेवा के साथ इंटरैक्ट करते हैं।

बच्चे
नेटफ्लिक्स सेवा की सदस्यता लेने के लिए आपकी आयु कम से कम 18 वर्ष या उससे अधिक होनी चाहिए। नाबालिग केवल माता-पिता या कानूनी अभिभावक की भागीदारी, पर्यवेक्षण और अनुमोदन के साथ ही सेवा का उपयोग कर सकते हैं।

इस गोपनीयता कथन में परिवर्तन
हम बदलती कानूनी, नियामक या परिचालन आवश्यकताओं के जवाब में इस गोपनीयता कथन को समय-समय पर अपडेट करेंगे। हम कानून के अनुसार ऐसे किसी भी बदलाव (जब वे प्रभावी होंगे सहित) की सूचना देंगे। आपका जारी रहा ऐसे किसी भी अपडेट के प्रभावी होने के बाद नेटफ्लिक्स सेवा का उपयोग उन परिवर्तनों की स्वीकृति और (जैसा लागू हो) स्वीकृति माना जाएगा। यदि आप इस गोपनीयता कथन में किसी भी अपडेट को स्वीकार या स्वीकार नहीं करना चाहते हैं, तो आप नेटफ्लिक्स सेवा का उपयोग रद्द कर सकते हैं। यह देखने के लिए कि यह गोपनीयता कथन अंतिम बार कब अद्यतन किया गया था, कृपया नीचे "अंतिम अद्यतन" अनुभाग देखें।''',style: TextStyle(color: isDark?Colors.black:Colors.white,fontWeight: FontWeight.w400),),
              SizedBox(
                height:20 ,
              ),
              DropdownButton<String>(
                value: selectedValue,
                borderRadius: BorderRadius.all(Radius.circular(10)),

                dropdownColor:isDark?Colors.white:Colors.black,
                onChanged: (String? newValue) {
                  setState(() {
                    selectedValue = newValue!;
                    // Navigate to the selected page
                    _navigateToPage(newValue);
                  });
                },
                style: TextStyle(color: isDark?Colors.black:Colors.white),
                items: <String>['English', 'हिंदी']
                    .map<DropdownMenuItem<String>>((String value) {
                  return DropdownMenuItem<String>(
                    value: value,
                    child: Text(value),
                  );
                }).toList(),
              ),
              SizedBox(
                height:100 ,
              ),
            ],
          ),
        ),
      ),
    );
  }
  void _navigateToPage(String selectedOption) {
    // Implement navigation logic based on the selected option
    switch (selectedOption) {
      case 'English ':
        Navigator.pushReplacement(
          context,
          MaterialPageRoute(builder: (context) => Legal()),
        );
        break;
      case 'हिंदी':
        Navigator.pushReplacement(
          context,
          MaterialPageRoute(builder: (context) => Legal_hindi()),
        );
        break;
      default:
      // Handle unexpected option
        break;
    }
  }
}
